tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
#include "web/IrrigationWeb.h"

#include <Arduino.h>
#include <Esp32Base.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>

#include "Version.h"
#include "domain/BusinessEventLog.h"
#include "domain/FlowCalibration.h"
#include "domain/MaintenanceService.h"
#include "domain/SafetyManager.h"
#include "domain/ZoneManager.h"
#include "storage/PlanStore.h"
#include "storage/RecordStore.h"
#include "storage/ScheduleSkipStore.h"
#include "storage/SystemConfigStore.h"
#include "storage/ZoneConfigStore.h"
#include "storage/ZoneErrorStore.h"

namespace {

void writeUInt(uint32_t value) {
    char text[16];
    snprintf(text, sizeof(text), "%lu", static_cast<unsigned long>(value));
    Esp32BaseWeb::sendChunk(text);
}

void writeBool(bool value) {
    Esp32BaseWeb::sendChunk(value ? "true" : "false");
}

void beginJson(int code = 200) {
    (void)Esp32BaseWeb::beginResponse(code, "application/json", nullptr);
}

void endJson() {
    Esp32BaseWeb::endResponse();
}

void sendError(int code, const char* error) {
    beginJson(code);
    Esp32BaseWeb::sendChunk("{\"ok\":false,\"error\":\"");
    Esp32BaseWeb::writeJsonEscaped(error ? error : "error");
    Esp32BaseWeb::sendChunk("\"}");
    endJson();
}

void sendOk() {
    Esp32BaseWeb::sendJson(200, "{\"ok\":true}");
}

void sendMethodNotAllowed(const char* allowed) {
    beginJson(405);
    Esp32BaseWeb::sendChunk("{\"ok\":false,\"error\":\"method_not_allowed\",\"allowed\":\"");
    Esp32BaseWeb::writeJsonEscaped(allowed);
    Esp32BaseWeb::sendChunk("\",\"method\":\"");
    Esp32BaseWeb::writeJsonEscaped(Esp32BaseWeb::currentMethodName());
    Esp32BaseWeb::sendChunk("\"}");
    endJson();
}

bool readU32(const char* name, uint32_t* value) {
    char text[24] = "";
    if (!value || !Esp32BaseWeb::getParam(name, text, sizeof(text))) {
        return false;
    }
    char* end = nullptr;
    const unsigned long parsed = strtoul(text, &end, 10);
    if (!end || *end != '\0') {
        return false;
    }
    *value = static_cast<uint32_t>(parsed);
    return true;
}

bool readU16(const char* name, uint16_t* value) {
    uint32_t raw = 0;
    if (!value || !readU32(name, &raw) || raw > 65535UL) {
        return false;
    }
    *value = static_cast<uint16_t>(raw);
    return true;
}

bool readU8(const char* name, uint8_t* value) {
    uint32_t raw = 0;
    if (!value || !readU32(name, &raw) || raw > 255UL) {
        return false;
    }
    *value = static_cast<uint8_t>(raw);
    return true;
}

bool readBool(const char* name, bool* value) {
    char text[8] = "";
    if (!value || !Esp32BaseWeb::getParam(name, text, sizeof(text))) {
        return false;
    }
    if (strcmp(text, "1") == 0 || strcmp(text, "true") == 0 || strcmp(text, "on") == 0) {
        *value = true;
        return true;
    }
    if (strcmp(text, "0") == 0 || strcmp(text, "false") == 0) {
        *value = false;
        return true;
    }
    return false;
}

bool readCheckbox(const char* name) {
    bool value = false;
    return Esp32BaseWeb::hasParam(name) && readBool(name, &value) && value;
}

bool readZoneId(uint8_t* zoneId) {
    return readU8("zoneId", zoneId) && Irrigation::validZoneId(*zoneId);
}

const char* zoneErrorLabel(Irrigation::ZoneErrorCode code);
const char* taskTypeLabel(Irrigation::TaskType type);

bool readYmd(const char* name, uint32_t* ymd) {
    char text[16] = "";
    if (!ymd || !Esp32BaseWeb::getParam(name, text, sizeof(text))) {
        return false;
    }
    if (strlen(text) == 10 && text[4] == '-' && text[7] == '-') {
        for (uint8_t i = 0; i < 10; ++i) {
            if ((i == 4 || i == 7) ? text[i] != '-' : (text[i] < '0' || text[i] > '9')) {
                return false;
            }
        }
        *ymd = static_cast<uint32_t>((text[0] - '0') * 1000 + (text[1] - '0') * 100 + (text[2] - '0') * 10 + (text[3] - '0')) * 10000UL +
               static_cast<uint32_t>((text[5] - '0') * 10 + (text[6] - '0')) * 100UL +
               static_cast<uint32_t>((text[8] - '0') * 10 + (text[9] - '0'));
        return true;
    }
    return readU32(name, ymd);
}

bool readTimeParam(const char* name, uint8_t* hour, uint8_t* minute) {
    char text[8] = "";
    if (!hour || !minute || !Esp32BaseWeb::getParam(name, text, sizeof(text)) || strlen(text) != 5 || text[2] != ':') {
        return false;
    }
    if (text[0] < '0' || text[0] > '9' || text[1] < '0' || text[1] > '9' ||
        text[3] < '0' || text[3] > '9' || text[4] < '0' || text[4] > '9') {
        return false;
    }
    const uint8_t h = static_cast<uint8_t>((text[0] - '0') * 10 + (text[1] - '0'));
    const uint8_t m = static_cast<uint8_t>((text[3] - '0') * 10 + (text[4] - '0'));
    if (h > 23 || m > 59) {
        return false;
    }
    *hour = h;
    *minute = m;
    return true;
}

Irrigation::StartSource startSourceFromRequest() {
    char source[16] = "";
    return Esp32BaseWeb::getParam("source", source, sizeof(source)) && strcmp(source, "web_page") == 0
        ? Irrigation::StartSource::WEB_PAGE
        : Irrigation::StartSource::HTTP_API;
}

Irrigation::StopSource stopSourceFromRequest() {
    char source[16] = "";
    return Esp32BaseWeb::getParam("source", source, sizeof(source)) && strcmp(source, "web_page") == 0
        ? Irrigation::StopSource::WEB_PAGE
        : Irrigation::StopSource::HTTP_API;
}

bool wantsRedirect() {
    char source[16] = "";
    return Esp32BaseWeb::getParam("source", source, sizeof(source)) && strcmp(source, "web_page") == 0;
}

void redirectOrOk(const char* path = "/index") {
    if (wantsRedirect() && !Esp32BaseWeb::isAjaxRequest()) {
        Esp32BaseWeb::redirectSeeOther(path);
        return;
    }
    sendOk();
}

uint32_t currentYmd() {
#if ESP32BASE_ENABLE_NTP
    if (!Esp32BaseNtp::isTimeSynced()) {
        return PlanStore::DefaultCycleStartYmd;
    }
    const time_t now = static_cast<time_t>(Esp32BaseNtp::timestamp());
    tm local = {};
    if (localtime_r(&now, &local) == nullptr) {
        return PlanStore::DefaultCycleStartYmd;
    }
    return static_cast<uint32_t>(local.tm_year + 1900) * 10000UL +
           static_cast<uint32_t>(local.tm_mon + 1) * 100UL +
           static_cast<uint32_t>(local.tm_mday);
#else
    return PlanStore::DefaultCycleStartYmd;
#endif
}

void writeDuration(uint32_t seconds) {
    writeUInt(seconds / 60UL);
    Esp32BaseWeb::sendChunk(" 分钟");
}

void writeTime(uint8_t hour, uint8_t minute) {
    char text[8];
    snprintf(text, sizeof(text), "%02u:%02u", static_cast<unsigned>(hour), static_cast<unsigned>(minute));
    Esp32BaseWeb::sendChunk(text);
}

void writeYmdInput(uint32_t ymd) {
    char text[12];
    snprintf(text, sizeof(text), "%04lu-%02lu-%02lu",
             static_cast<unsigned long>(ymd / 10000UL),
             static_cast<unsigned long>((ymd / 100UL) % 100UL),
             static_cast<unsigned long>(ymd % 100UL));
    Esp32BaseWeb::sendChunk(text);
}

const char* uiToneForState(Irrigation::ZoneState state) {
    switch (state) {
        case Irrigation::ZoneState::RUNNING:
        case Irrigation::ZoneState::STARTING: return " warn";
        case Irrigation::ZoneState::ERROR: return " danger";
        case Irrigation::ZoneState::IDLE: return " ok";
        case Irrigation::ZoneState::DISABLED:
        default: return "";
    }
}

