tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void writeStatusJson(const Irrigation::ZoneStatus& status) {
    Esp32BaseWeb::sendChunk("{\"zoneId\":");
    writeUInt(status.zoneId);
    Esp32BaseWeb::sendChunk(",\"state\":\"");
    Esp32BaseWeb::writeJsonEscaped(Irrigation::zoneStateName(status.state));
    Esp32BaseWeb::sendChunk("\",\"enabled\":");
    writeBool(status.enabled);
    Esp32BaseWeb::sendChunk(",\"busy\":");
    writeBool(status.busy);
    Esp32BaseWeb::sendChunk(",\"errorActive\":");
    writeBool(status.errorActive);
    Esp32BaseWeb::sendChunk(",\"errorCode\":\"");
    Esp32BaseWeb::writeJsonEscaped(zoneErrorLabel(status.errorCode));
    Esp32BaseWeb::sendChunk("\"");
    Esp32BaseWeb::sendChunk(",\"taskType\":\"");
    Esp32BaseWeb::writeJsonEscaped(Irrigation::taskTypeName(status.taskType));
    Esp32BaseWeb::sendChunk("\",\"taskLabel\":\"");
    Esp32BaseWeb::writeJsonEscaped(status.busy ? taskTypeLabel(status.taskType) : "-");
    Esp32BaseWeb::sendChunk("\"");
    Esp32BaseWeb::sendChunk(",\"targetSec\":");
    writeUInt(status.targetSec);
    Esp32BaseWeb::sendChunk(",\"elapsedSec\":");
    writeUInt(status.elapsedSec);
    Esp32BaseWeb::sendChunk(",\"remainingSec\":");
    writeUInt(status.remainingSec);
    Esp32BaseWeb::sendChunk(",\"pulses\":");
    writeUInt(status.pulses);
    Esp32BaseWeb::sendChunk(",\"estimatedMl\":");
    writeUInt(status.estimatedMilliliters);
    Esp32BaseWeb::sendChunk(",\"flowRatePerMinuteX1000\":");
    writeUInt(status.flowRatePerMinuteX1000);
    Esp32BaseWeb::sendChunk(",\"planId\":");
    writeUInt(status.planId);
    Esp32BaseWeb::sendChunk("}");
}

void writePlanJson(const Irrigation::PlanDefinition& plan) {
    Esp32BaseWeb::sendChunk("{\"exists\":");
    writeBool(plan.exists);
    Esp32BaseWeb::sendChunk(",\"planId\":");
    writeUInt(plan.planId);
    Esp32BaseWeb::sendChunk(",\"zoneId\":");
    writeUInt(plan.zoneId);
    Esp32BaseWeb::sendChunk(",\"slotIndex\":");
    writeUInt(plan.slotIndex);
    Esp32BaseWeb::sendChunk(",\"name\":\"");
    Esp32BaseWeb::writeJsonEscaped(plan.name);
    Esp32BaseWeb::sendChunk("\",\"enabled\":");
    writeBool(plan.enabled);
    Esp32BaseWeb::sendChunk(",\"time\":\"");
    writeTime(plan.timeHour, plan.timeMinute);
    Esp32BaseWeb::sendChunk("\",\"durationSec\":");
    writeUInt(plan.durationSec);
    Esp32BaseWeb::sendChunk(",\"cycleDays\":");
    writeUInt(plan.cycleDays);
    Esp32BaseWeb::sendChunk(",\"cycleMask\":");
    writeUInt(plan.cycleMask);
    Esp32BaseWeb::sendChunk(",\"cycleStartYmd\":");
    writeUInt(plan.cycleStartYmd);
    Esp32BaseWeb::sendChunk("}");
}

void writeOnePostHidden(const char* name, const char* value) {
    Esp32BaseWeb::sendChunk("<input type='hidden' name='");
    Esp32BaseWeb::writeHtmlEscaped(name);
    Esp32BaseWeb::sendChunk("' value='");
    Esp32BaseWeb::writeHtmlEscaped(value);
    Esp32BaseWeb::sendChunk("'>");
}

void writeHiddenU32(const char* name, uint32_t value) {
    char text[16];
    snprintf(text, sizeof(text), "%lu", static_cast<unsigned long>(value));
    writeOnePostHidden(name, text);
}

void pageHeader(const char* title) {
    Esp32BaseWeb::sendHeader(title);
}

void pageFooter() {
    Esp32BaseWeb::sendFooter();
}

uint32_t durationMinutesForUi(uint32_t seconds) {
    return seconds == 0 ? 0 : ((seconds + 59UL) / 60UL);
}

void writeDurationMinutes(uint32_t seconds) {
    writeUInt(durationMinutesForUi(seconds));
    Esp32BaseWeb::sendChunk(" 分钟");
}

void writeCycleSummary(const Irrigation::PlanDefinition& plan) {
    writeUInt(plan.cycleDays);
    Esp32BaseWeb::sendChunk(" 天循环：");
    bool first = true;
    for (uint8_t i = 0; i < plan.cycleDays; ++i) {
        if ((plan.cycleMask & (1UL << i)) == 0) {
            continue;
        }
        if (!first) {
            Esp32BaseWeb::sendChunk("、");
        }
        first = false;
        Esp32BaseWeb::sendChunk("第 ");
        writeUInt(i + 1);
        Esp32BaseWeb::sendChunk(" 天");
    }
}

void formatDurationHuman(uint32_t seconds, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    const uint32_t hours = seconds / 3600UL;
    const uint32_t minutes = (seconds % 3600UL) / 60UL;
    const uint32_t secs = seconds % 60UL;
    size_t used = 0;
    out[0] = '\0';
    if (hours > 0) {
        used += snprintf(out + used, len - used, "%lu小时", static_cast<unsigned long>(hours));
    }
    if (used < len && minutes > 0) {
        used += snprintf(out + used, len - used, "%lu分钟", static_cast<unsigned long>(minutes));
    }
    if (used < len && (secs > 0 || used == 0)) {
        (void)snprintf(out + used, len - used, "%lu秒", static_cast<unsigned long>(secs));
    }
}

void writeDurationHuman(uint32_t seconds) {
    char text[32];
    formatDurationHuman(seconds, text, sizeof(text));
    Esp32BaseWeb::sendChunk(text);
}

void writeDurationMsHuman(uint32_t ms) {
    writeDurationHuman((ms + 999UL) / 1000UL);
}

void writeDurationMsHumanCompact(uint32_t ms) {
    writeDurationHuman((ms + 999UL) / 1000UL);
}

void writeLitersFromMilliliters(uint32_t milliliters) {
    char text[24];
    snprintf(text, sizeof(text), "%lu.%03lu L",
             static_cast<unsigned long>(milliliters / 1000UL),
             static_cast<unsigned long>(milliliters % 1000UL));
    Esp32BaseWeb::sendChunk(text);
}

const char* calibrationStateLabel(FlowCalibration::State state) {
    switch (state) {
        case FlowCalibration::State::CAPTURING: return "采集中";
        case FlowCalibration::State::WAITING_ACTUAL: return "等待输入水量";
        case FlowCalibration::State::IDLE:
        default: return "空闲";
    }
}

static constexpr uint32_t calibrationWindowMs = 2000UL;
static constexpr uint32_t calibrationWindowStepMs = 200UL;

void writePermilleAsPercent(uint16_t permille) {
    writeUInt(permille / 10U);
    Esp32BaseWeb::sendChunk(".");
    writeUInt(permille % 10U);
    Esp32BaseWeb::sendChunk("%");
}

const char* calibrationRecommendationAdvice(const FlowCalibration::Recommendation& rec) {
    if (rec.sampleCount <= 1) {
        return "单条样本只能生成单点估计，无法交叉验证误差；建议补采不同水量样本。";
    }
    if (rec.sampleCount == 2) {
        if (rec.volumeSpanPermille < 200 || rec.pulseSpanPermille < 200) {
            return "两条样本水量或脉冲跨度偏小，建议补采一条明显不同水量的样本。";
        }
        if (rec.averageErrorPermille <= 50 && rec.maxErrorPermille <= 80) {
            return "两条样本拟合误差较小，可试用；建议补采一条不同水量样本做验证。";
        }
        return "两条样本拟合误差偏大，建议重采或检查接水量、流量稳定性。";
    }
    if (rec.averageErrorPermille <= 50 && rec.maxErrorPermille <= 80) {
        return "样本内误差较小，建议可应用。";
    }
    if (rec.averageErrorPermille <= 100 && rec.maxErrorPermille <= 150) {
        return "样本内误差可接受，可应用但建议复核。";
    }
    return "样本误差偏大，不建议应用；建议重采或检查接水量、流量稳定性。";
}

void writeSvgPoint(uint32_t x, uint32_t y) {
    char text[32];
    snprintf(text, sizeof(text), "%lu,%lu ", static_cast<unsigned long>(x), static_cast<unsigned long>(y));
    Esp32BaseWeb::sendChunk(text);
}

void writeChartTimeLabel(uint32_t ms) {
    if (ms < 10000UL && (ms % 1000UL) != 0) {
        writeUInt(ms / 1000UL);
        Esp32BaseWeb::sendChunk(".");
        writeUInt((ms % 1000UL) / 100UL);
        Esp32BaseWeb::sendChunk("秒");
        return;
    }
    writeUInt((ms + 500UL) / 1000UL);
    Esp32BaseWeb::sendChunk("秒");
}

void writeChartAxisTitle(const char* xTitle,
                         const char* yTitle,
                         uint32_t left,
                         uint32_t top,
                         uint32_t width,
                         uint32_t height,
                         uint32_t svgHeight) {
    Esp32BaseWeb::sendChunk("<text class='chart-axis-title' x='");
    writeUInt(left + width / 2UL);
    Esp32BaseWeb::sendChunk("' y='");
    writeUInt(svgHeight - 10UL);
    Esp32BaseWeb::sendChunk("' text-anchor='middle'>");
    Esp32BaseWeb::writeHtmlEscaped(xTitle);
    Esp32BaseWeb::sendChunk("</text><text class='chart-axis-title' x='");
    writeUInt(14);
    Esp32BaseWeb::sendChunk("' y='");
    writeUInt(top + height / 2UL);
    Esp32BaseWeb::sendChunk("' text-anchor='middle' transform='rotate(-90 14 ");
    writeUInt(top + height / 2UL);
    Esp32BaseWeb::sendChunk(")'>");
    Esp32BaseWeb::writeHtmlEscaped(yTitle);
    Esp32BaseWeb::sendChunk("</text>");
}

void writeChartTicks(uint32_t durationMs,
                     uint32_t maxValue,
                     uint32_t left,
                     uint32_t top,
                     uint32_t width,
                     uint32_t height) {
    static constexpr uint8_t xSegments = 6;
    static constexpr uint8_t ySegments = 5;
    for (uint8_t i = 0; i <= xSegments; ++i) {
        const uint32_t x = left + static_cast<uint32_t>((static_cast<uint64_t>(width) * i) / xSegments);
        const uint32_t labelMs = static_cast<uint32_t>((static_cast<uint64_t>(durationMs) * i) / xSegments);
        Esp32BaseWeb::sendChunk("<line class='chart-grid' x1='");
        writeUInt(x);
        Esp32BaseWeb::sendChunk("' y1='");
        writeUInt(top);
        Esp32BaseWeb::sendChunk("' x2='");
        writeUInt(x);
        Esp32BaseWeb::sendChunk("' y2='");
        writeUInt(top + height);
        Esp32BaseWeb::sendChunk("'></line><text class='chart-tick' x='");
        writeUInt(x);
        Esp32BaseWeb::sendChunk("' y='");
        writeUInt(top + height + 18UL);
        Esp32BaseWeb::sendChunk("' text-anchor='middle'>");
        writeChartTimeLabel(labelMs);
        Esp32BaseWeb::sendChunk("</text>");
    }
    for (uint8_t i = 0; i <= ySegments; ++i) {
        const uint32_t y = top + height - static_cast<uint32_t>((static_cast<uint64_t>(height) * i) / ySegments);
        const uint32_t value = static_cast<uint32_t>((static_cast<uint64_t>(maxValue) * i) / ySegments);
        Esp32BaseWeb::sendChunk("<line class='chart-grid' x1='");
        writeUInt(left);
        Esp32BaseWeb::sendChunk("' y1='");
        writeUInt(y);
        Esp32BaseWeb::sendChunk("' x2='");
        writeUInt(left + width);
        Esp32BaseWeb::sendChunk("' y2='");
        writeUInt(y);
        Esp32BaseWeb::sendChunk("'></line><text class='chart-tick' x='");
        writeUInt(left - 10UL);
        Esp32BaseWeb::sendChunk("' y='");
        writeUInt(y + 4UL);
        Esp32BaseWeb::sendChunk("' text-anchor='end'>");
        writeUInt(value);
        Esp32BaseWeb::sendChunk("</text>");
    }
}

void writeStableMarker(uint32_t stableStartMs, uint32_t durationMs, uint32_t left, uint32_t top, uint32_t width, uint32_t height) {
    if (stableStartMs == 0 || durationMs == 0 || stableStartMs > durationMs) {
        return;
    }
    const uint32_t x = left + static_cast<uint32_t>((static_cast<uint64_t>(stableStartMs) * width) / durationMs);
    Esp32BaseWeb::sendChunk("<rect x='");
    writeUInt(left);
    Esp32BaseWeb::sendChunk("' y='");
    writeUInt(top);
    Esp32BaseWeb::sendChunk("' width='");
    writeUInt(x > left ? x - left : 0);
    Esp32BaseWeb::sendChunk("' height='");
    writeUInt(height);
    Esp32BaseWeb::sendChunk("' class='chart-startup'></rect><line x1='");
    writeUInt(x);
    Esp32BaseWeb::sendChunk("' y1='");
    writeUInt(top);
    Esp32BaseWeb::sendChunk("' x2='");
    writeUInt(x);
    Esp32BaseWeb::sendChunk("' y2='");
    writeUInt(top + height);
    Esp32BaseWeb::sendChunk("' class='chart-stable-marker'></line>");
}

