tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void handleCalibrationStopApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    if (!FlowCalibration::stop()) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    redirectOrOk("/irrigation/calibration");
}

void handleCalibrationSampleApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    uint32_t actualMl = 0;
    if (!readU32("actualMl", &actualMl) || actualMl == 0) {
        sendError(400, "invalid_actual_ml");
        return;
    }
    if (!FlowCalibration::submitActualMilliliters(actualMl)) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    redirectOrOk("/irrigation/calibration");
}

void handleCalibrationSampleUpdateApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    uint8_t sampleIndex = 0;
    uint32_t actualMl = 0;
    if (!readU8("sampleIndex", &sampleIndex) ||
        !readU32("actualMl", &actualMl) ||
        actualMl == 0) {
        sendError(400, "invalid_sample_update");
        return;
    }
    if (!FlowCalibration::updateActualMilliliters(sampleIndex, actualMl)) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    redirectOrOk("/irrigation/calibration");
}

void handleCalibrationComputeApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    FlowCalibration::Recommendation rec = {};
    if (!FlowCalibration::computeRecommendation(&rec)) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    redirectOrOk("/irrigation/calibration");
}

void handleCalibrationApplyApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    if (!FlowCalibration::saveCandidate()) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    redirectOrOk("/irrigation/zones");
}

void handleCalibrationClearApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    (void)FlowCalibration::clear();
    redirectOrOk("/irrigation/calibration");
}

void handleZoneStartApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    uint8_t zoneId = 0;
    uint32_t durationSec = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_start_request");
        return;
    }
    if (Esp32BaseWeb::hasParam("durationMin")) {
        uint32_t durationMin = 0;
        if (!readU32("durationMin", &durationMin) || durationMin == 0 || durationMin > (SystemConfigStore::current().maxWateringDurationSec / 60UL)) {
            sendError(400, "invalid_start_duration");
            return;
        }
        durationSec = durationMin * 60UL;
    } else if (!readU32("durationSec", &durationSec)) {
        sendError(400, "invalid_start_request");
        return;
    }
    if (!ZoneManager::startManual(zoneId, durationSec, startSourceFromRequest())) {
        sendError(409, "zone_start_rejected");
        return;
    }
    redirectOrOk();
}

void handleZoneStopApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    uint8_t zoneId = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_zone");
        return;
    }
    (void)ZoneManager::stopZone(zoneId, stopSourceFromRequest());
    redirectOrOk();
}

void handleZonesStopAllApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    (void)ZoneManager::stopAll(stopSourceFromRequest());
    redirectOrOk();
}

void handleZoneConfigApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    uint8_t zoneId = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_zone");
        return;
    }
    Irrigation::ZoneConfig zone = ZoneConfigStore::get(zoneId);
    const char* error = nullptr;
    if (Esp32BaseWeb::hasParam("name") && !Esp32BaseWeb::getParam("name", zone.name, sizeof(zone.name))) {
        error = "invalid_name";
    } else if (Esp32BaseWeb::hasParam("enabledPresent")) {
        zone.enabled = readCheckbox("enabled");
    } else if (Esp32BaseWeb::hasParam("enabled") && !readBool("enabled", &zone.enabled)) {
        error = "invalid_enabled";
    }
    if (!error && Esp32BaseWeb::hasParam("startupPulseLimit") && !readU16("startupPulseLimit", &zone.flow.startupPulseLimit)) {
        error = "invalid_startup_pulse_limit";
    }
    if (!error && Esp32BaseWeb::hasParam("startupEstimatedMl") && !readU16("startupEstimatedMl", &zone.flow.startupEstimatedMl)) {
        error = "invalid_startup_estimated_ml";
    }
    if (!error && Esp32BaseWeb::hasParam("stablePulsePerLiter") && !readU16("stablePulsePerLiter", &zone.flow.stablePulsePerLiter)) {
        error = "invalid_stable_pulse_per_liter";
    }
    if (!error && Esp32BaseWeb::hasParam("startTimeoutSec") && !readU16("startTimeoutSec", &zone.startTimeoutSec)) {
        error = "invalid_start_timeout";
    }
    if (!error && Esp32BaseWeb::hasParam("flowNoPulseTimeoutSec") && !readU16("flowNoPulseTimeoutSec", &zone.flowNoPulseTimeoutSec)) {
        error = "invalid_no_pulse_timeout";
    }
    if (!error && Esp32BaseWeb::hasParam("suppressErrorPresent")) {
        zone.suppressError = readCheckbox("suppressError");
    } else if (!error && Esp32BaseWeb::hasParam("suppressError") && !readBool("suppressError", &zone.suppressError)) {
        error = "invalid_suppress_error";
    }
    if (error) {
        sendError(400, error);
        return;
    }
    if (!ZoneConfigStore::set(zoneId, zone)) {
        sendError(400, "invalid_zone_config");
        return;
    }
    (void)ZoneManager::reloadZone(zoneId);
    redirectOrOk("/irrigation/zones");
}

void handleZoneClearErrorApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    uint8_t zoneId = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_zone");
        return;
    }
    if (!ZoneManager::clearError(zoneId)) {
        sendError(400, "clear_error_failed");
        return;
    }
    redirectOrOk("/index?alert_cleared=1");
}

void handlePlansApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        sendMethodNotAllowed("GET");
        return;
    }
    uint8_t zoneId = 0;
    const bool filter = Esp32BaseWeb::hasParam("zoneId");
    if (filter && !readZoneId(&zoneId)) {
        sendError(400, "invalid_zone");
        return;
    }
    beginJson(200);
    Esp32BaseWeb::sendChunk("{\"ok\":true,\"plans\":[");
    bool first = true;
    for (uint8_t z = 1; z <= Irrigation::MaxZones; ++z) {
        if (filter && z != zoneId) continue;
        for (uint8_t slot = 0; slot < Irrigation::MaxPlansPerZone; ++slot) {
            const Irrigation::PlanDefinition& plan = PlanStore::getBySlot(z, slot);
            if (!plan.exists) continue;
            if (!first) Esp32BaseWeb::sendChunk(",");
            first = false;
            writePlanJson(plan);
        }
    }
    Esp32BaseWeb::sendChunk("]}");
    endJson();
}

void handlePlanCreateApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    uint8_t zoneId = 0;
    Irrigation::PlanDefinition plan = {};
    const char* error = nullptr;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_zone");
        return;
    }
    plan = makeDraftPlan(zoneId);
    if (!applyPlanForm(plan, &error)) {
        sendError(400, error);
        return;
    }
    if (!PlanStore::create(zoneId, plan, &plan)) {
        sendError(400, "plan_create_failed");
        return;
    }
    if (wantsRedirect()) {
        char path[48];
        snprintf(path, sizeof(path), "/irrigation/plan?planId=%lu", static_cast<unsigned long>(plan.planId));
        Esp32BaseWeb::redirectSeeOther(path);
        return;
    }
    beginJson(200);
    Esp32BaseWeb::sendChunk("{\"ok\":true,\"plan\":");
    writePlanJson(plan);
    Esp32BaseWeb::sendChunk("}");
    endJson();
}

bool updatePlanEnabled(bool enabled) {
    uint32_t planId = 0;
    Irrigation::PlanDefinition plan = {};
    if (!readU32("planId", &planId) || !PlanStore::getById(planId, &plan)) {
        sendError(400, "plan_not_found");
        return false;
    }
    plan.enabled = enabled;
    if (!PlanStore::set(planId, plan)) {
        sendError(400, "plan_save_failed");
        return false;
    }
    redirectOrOk("/irrigation/plans");
    return true;
}

void handlePlanEnableApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    (void)updatePlanEnabled(true);
}

void handlePlanDisableApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    (void)updatePlanEnabled(false);
}

void handlePlanDeleteApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    uint32_t planId = 0;
    if (!readU32("planId", &planId) || !PlanStore::remove(planId)) {
        sendError(400, "plan_delete_failed");
        return;
    }
    redirectOrOk("/irrigation/plans");
}

void handlePlanUpdateApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    uint32_t planId = 0;
    Irrigation::PlanDefinition plan = {};
    if (!readU32("planId", &planId) || !PlanStore::getById(planId, &plan)) {
        sendError(400, "plan_not_found");
        return;
    }
    const char* error = nullptr;
    if (!applyPlanForm(plan, &error)) {
        sendError(400, error);
    } else if (!PlanStore::set(planId, plan)) {
        sendError(400, "plan_save_failed");
    } else {
        redirectOrOk("/irrigation/plans");
    }
}

